Documents/Приемка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Приемка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыЗаказа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Приемка/Ext/ManagerModule.bsl
// Возвращает выборку уникальных заказов в документе
Функция ВыбратьЗаказы(Знач Ссылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Заказ КАК Заказ
	|ИЗ
	|	Документ.Приемка.Заказы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПринятьЗаказы(Знач КоллекцияЗаказов) Экспорт
	
	ДокументПриемки = Документы.Приемка.СоздатьДокумент();
	ДокументПриемки.УстановитьНовыйНомер();
	ДокументПриемки.Дата = ТекущаяДатаСеанса();
	
	Для Каждого Заказ Из КоллекцияЗаказов Цикл
		ДокументПриемки.Заказы.Добавить().Заказ = Заказ;
	КонецЦикла;	
	
	Попытка
		ДокументПриемки.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокументПриемки.Ссылка;
	
КонецФункции
